#Задание 1
a = 5
print(a)
b = int(input("Введите число "))
print(b)
c = input("Введите слово ")
print(c)